#+LATEX_HEADER: \usepackage[style=oscola]{biblatex}
#+Latex_header: \addbibresource{~/tmp/legal.bib}

This is a citation of a case, which does not work.footcite:GreenhalghvArderneCinemasLtd1951
And this is a citation of a book, which does work.footcite:Kershaw2012 



#+BEGIN_SRC emacs-lisp
(let ((bibtex-completion-bibliography "~/tmp/legal.bib"))
  (bibtex-completion-get-entry "GreenhalghvArderneCinemasLtd1951"))
#+END_SRC

#+RESULTS:
: ((=key= . GreenhalghvArderneCinemasLtd1951) (=type= . jurisdiction) (Date . {1951}) (Journaltitle . {Ch}) (Options . {year-essential=true}) (Pages . {286}) (Pagination . {[]}) (Shorttitle . {Greenhalgh v Arderne}) (Title . {Greenhalgh v Arderne Cinemas Ltd}))

#+BEGIN_SRC emacs-lisp
(org-ref-find-bibliography)
#+END_SRC

#+RESULTS:
| ~/tmp/legal.bib |


#+BEGIN_SRC emacs-lisp
(org-ref-format-entry "GreenhalghvArderneCinemasLtd1951")
#+END_SRC

#+RESULTS:
: , /Greenhalgh v arderne cinemas ltd/ ().

